{
    "1": {
        "id": 1,
        "name": "Pat Palmer",
        "designation": "Principal Investigator/ Príomhthaighdeoir",
        "imgURL":"images/photos/Pat.webp",
        "title": "Professor of Renaissance Literature, Maynooth University",
        "ie_title": "Ollamh le litríocht, Ollscoil Mhá Nuad",
        "email": "pat.palmer@mu.ie",
        "ie_text": "Bíonn Patricia Palmer ag obair ar theagmháil chultúr, in Éirinn sa Nua-aois Luath go príomha – ar mhalartuithe coimhlinteacha idir coilínigh Shasanacha agus an saol Gealach, ar an gcoilíniú teanga, ar aeistéitic an fhoréigin agus ar pholaitíocht an aistriúcháin. Tá gné fhollasach chomparáideach ag baint lena cuid taighde, agus plé déanta aici ar aistriúcháin ar Ariosto, Ercilla agus Virgil, agus ar fhilíocht chlasaiceach na Gaeilge. Is í a scríobh Language and Conquest in Early Modern Ireland: English Renaissance Literature and Elizabeth Imperial Expansion (Cambridge University Press, 2001) agus The Severed Head and the Grafted Tongue: Translating Violence in Early Modern Ireland (Cambridge University Press, 2014). Foilsíodh saothair léi in English Literary Renaissance, Translation Studies, Renaissance Quarterly, Irish Historical Studies, Literature Compass, agus i gcnuasaigh aistí eile, ar réimse fairsing ábhar. Foilsíodh Early Modern Criticism in a Time of Crisis i Samhain 2022, atá curtha in eagar aici agus ag David Baker. Castacht agus trasnaíocht chultúr liteartha na hÉireann sa Nua-aois Luath is ábhar don leabhar atá idir lámha faoi láthair aici: Darkness Echoing, or Did Ireland Have a Renaissance? /n Tar éis di céim mháistreachta a bhaint amach i gColáiste na hOllscoile, Corcaigh, chaith Pat seal ag obair san Ataen agus sa Bhruiséil, sular thug sí faoi thaighde dochtúireachta in Ollscoil Oxford. Bhí sí in léachtóir sinsearach in Ollscoil York (2000-2008) agus i gColáiste na Ríthe i Londain ina dhiaidh sin í (2008-2016). Tá sí ina hOllamh le Litríocht na hAthbheochana in Ollscoil Mhá Nuad ó bhí 2017 ann. /n Bhronn an Chomhairle um Thaighde in Éirinn (IRC) ardghradaim uirthi sa bhliain 2019, agus is í príomhthaighdeoir MACMORRIS í, tionscadal 4 bliana a bhfuil sé mar aidhm aige saibhreas agus fairsinge ghníomhachtaí cultúrtha na hÉireann sa Nua-Aois Luath, thar theangacha agus eitneachtaí, a léiriú.",
        "text": "Patricia Palmer works on cultures in contact in, principally, early modern Ireland, on the conflictual exchange between English colonists and the Gaelic world, on linguistic colonisation, the aesthetics of violence, and the politics of translation. There is a strong comparative element to her work: she has written on translations of Ariosto, Ercilla, and Virgil, and on bardic poetry. She is the author of Language and Conquest in Early Modern Ireland: English Renaissance Literature and Elizabeth Imperial Expansion (Cambridge University Press, 2001) and The Severed Head and the Grafted Tongue: Translating Violence in Early Modern Ireland (Cambridge University Press, 2014). She has published articles with English Literary Renaissance, Translation Studies, Renaissance Quarterly, Irish Historical Studies, and Literature Compass. Early Modern Criticism in a Time of Crisis which she edited with David Baker was published in November 2022. Her current book project is a study of the polyphonic and intersecting literary cultures of early modern Ireland, Darkness Echoing, or Did Ireland Have a Renaissance. \n After graduating with an MA from University College Cork, she worked in Athens and Brussels before taking a D.Phil. in English literature at the University of Oxford. She was Senior Lecturer in the University of York (2000-2008) and Reader in King’s College London (2008-2016) and took up the chair of Renaissance Literature in Maynooth in 2017. \n She was awarded an Advanced Laureate by the Irish Research Council in 2019 and is Principal Investigator on the MACMORRIS Project, a four-year DH project which seeks to map the full range of cultural activity, across languages and ethnic groups, in early modern Ireland."
    },
    "2" : {
        "id": "2",
        "name": "Evan Bourke",
        "designation":"Project Manager/ Bainisteoir an tionscadail",
        "imgURL":"/images/photos/Evan.webp",
        "title": "Arts & Humanities Institute Maynooth University",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "evan.bourke@mu.ie",
        "twitter": "evan_bourke",
        "ie_text": "Is staraí liteartha é Evan Bourke a bhfuil suim ar leith aige i stair na hÉireann sa Nua-aois Luath agus sna daonnachtaí digiteacha. Tá suim ar leith aige sa scríbhneoireacht bheathaisnéiseach agus scríbhneoirneacht na mban, chomh maith le húsáid anailís ar líonraí agus léirshamhlú sonraí mar bhealach le scrúdú a dhéanamh ar théacsanna na Nua-aoise Luaithe. Chríochnaigh sé a PhD (maoinithe ag RECIRC agus OÉ Gaillimh) le Ollscoil na hÉireann Gaillimh in 2018. /n Rinneadh anailís ina thráchtas ar mhúnlú agus ar léiriú cháil triúr ban a raibh baint acu le ciorcal comhfhreagrais Samuel Hartlib: Katherine Jones, Viscountess Ranelagh (1615-1691); Dorothy Moore Dury (c.1612-1664); agus Jean Appelius (fl.1638-1648). /n Sular thosaigh sé le MACMORRIS, ba thaighdeoir iardhochtúireachta é Evan le RECIRC (The Reception and Circulation of Early Modern Women’s Writing, 1550-1700), áit a raibh páirt aige i ndearadh shuíomh idirlín agus taispeántas RECIRC. Tá saothar foilsithe aige in Literature Compass agus The Seventeenth Century Journal, Irish Historical Studies, Renaissance Quarterly, agus Huntington Library Quarterly ar ábhair a bhaineann le hanailís líonraí, stair na nban, agus Éire sa Nua-aois Luath. ",
        "text": "Evan Bourke is a literary historian with a particular interest in the literature of early modern Ireland and digital humanities. He is especially interested in the study of life writing and  women’s writing, and the use of network analysis and data visualisation as a tool for examining early modern texts. He completed his PhD (RECIRC and NUI Galway-funded) at the National University of Ireland, Galway in 2018. \n Evan’s doctoral thesis analysed the formation and representation of the reputations of three women connected to Samuel Hartlib’s correspondence network: Katherine Jones, Viscountess Ranelagh (1615-1691); Dorothy Moore Dury (c.1612-1664); and Jean Appelius (fl.1638-1648). \n Prior to joining MACMORRIS, Evan was a postdoctoral researcher for RECIRC (The Reception and Circulation of Early Modern Women’s Writing, 1550-1700), where he was involved in the design of the RECIRC website and exhibition. He has published in a range of journals including Literature Compass, The Seventeenth Century Journal, Irish Historical Studies, Renaissance Quarterly, and Huntington Library Quarterly on topics relating to network analysis, women’s history and early modern Ireland."
    },
    "3":  {
        "id": "3",
        "name": "Deirdre Nic Chárthaigh",
        "designation":"Postdoctoral Researcher/ Taighdeoir iardhochtúireachta",
        "imgURL":"/images/photos/Deirdre.webp",
        "title": "Lecturer of Modern Irish, Trinity College Dublin",
        "ie_title": "Léachtóir le Gaeilge nua-aimseartha, Coláiste na Tríonóide",
        "email": "nicchard@tcd.ie",
        "twitter": "Deirdrenicc",
        "ie_text": "Bhí Deirdre Nic Chárthaigh ag obair mar thaighdeoir iardhochtúireachta ar thionscadal MACMORRIS idir 2019 agus 2021.  Tá sí ag obair anois mar léachtóir i gColáiste na Tríonóide, Baile Átha Cliath. Baineann a cuid taighde le filíocht Chlasaiceach na hÉireann agus le traidisiún na lámhscríbhinní sa tréimhse i ndiaidh na Nua-Aoise Luaithe. Tá ailt foilsithe aici in Celtica agus in Ériu. I measc na bhfoilsiúchán léi a bheidh ag teacht amach go luath tá alt in Renaissance Quarterly agus eagrán den scéal Bodach an Chóta Lachtna, a bheidh mar chuid de shraith téacsanna Gaeilge ón Nua-Aois Luath atá á foilsiú ag Institiúid Ard-Léinn Bhaile Átha Cliath. Tá Deirdre ag obair ar thionscadal Léamh.org chomh maith ó bhí 2018 ann.",
        "text": "Deirdre Nic Chárthaigh worked as a post-doctoral researcher on the MACMORRIS project from 2019 to 2021. She is now a lecturer in the department of Irish at Trinity College, Dublin. Her research interests include early modern Irish poetry and prose, and the Irish manuscript tradition in the post-classical period. She has published articles in Celtica and Ériu. Her forthcoming publications include an article in Renaissance Quarterly (co-authored by Dr Evan Bourke) and an edition of the early modern Irish text Bodach an Chóta Lachtna, which will be published by the Dublin Institute for Advanced Studies as part of the Early Modern Irish Texts Series. Deirdre is a member of the working group of the project Léamh since 2018."
    },
    "4": {
        "id": "4",
        "name": "Philip Mac a’ Ghoill",
        "designation": "Postdoctoral Researcher/ Taighdeoir iardhochtúireachta",
        "imgURL":"/images/photos/Phil.webp",
        "title": "Arts & Humanities Institute Maynooth University",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "Philip.MacAGhoill@mu.ie",
        "text": "Philip Mac a’ Ghoill completed his PhD with Trinity College Dublin in March 2021. His research focuses mainly on Classical Irish poetry, examining the language, literary aspects, and historical context of poems from the Early Modern Irish period. He is also interested in the use digital humanities technology to promote research in this field, and he was involved in the Léamh.org project and SketchEngine Bardic Poetry Corpus project before beginning work with MACMORRIS. \n More recently, he has spent time in the field of socio-linguistics working as Language Planning Officer in the Cloich Cheann Fhaola language planning district in the Donegal Gaeltacht. He has recently published a critical edition of the 16th century Irish poem Trom an suan-sa ort, a Aodh in Celtica which includes a translation as well as notes on the language and historical context."
    },
    "5": {
        "id": "5",
        "name": "Rupavathi S",
        "designation": "Lead Programmer/ Ríomhchláraitheoir",
        "imgURL":"/images/photos/Ruby.webp",
        "title": "Arts & Humanities Institute Maynooth University",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "rupavathi.subramani@mu.ie",
        "ie_text": "Is ríomhchláraitheoir Bunachair agus réalóir Cúil in Institiúid na nEalaíon agus na nDaonnachtaí in Ollscoil Mhá Nuad í Rupavathi. Tá Rupavathi freagrach as dearadh agus as forbairt infreastruchtúr, bunachar agus feidhmchláir fhoireann thaighde MACMORRIS. Is í a bheidh ag cruthú na n-uirlisí do léirshamhlú sonraí an tionscnaimh, léarscáil idirghníomhach agus léirshamhluithe gréasáin ina measc. \n Bhain Rupavathi céim amach sa Teicneolaíocht Faisnéise sa bhliain 2016 agus chaith sí seal ag obair mar réalóir bogearraí in India agus sa RA.",
        "text": "Rupavathi Subramani is a Database Programmer and Backend Developer in the Arts and Humanities Institute at Maynooth University. \n For the MACMORRIS project, Rupavathi is responsible for the design and development of the infrastructure, database and related web applications used by the research team. This includes the creation of data visualisation tools for the project, including interactive maps and network visualisations. \n Rupavathi completed her Bachelors in Information Technology in 2016 and worked as a software developer in India and the UK."
    },
    "6":  {
        "id": "6",
        "name": "Alan Waldron",
        "designation": "PhD Researcher/ Taighdeoir PhD",
        "imgURL":"/images/photos/Alan.webp",
        "title": "Arts & Humanities Institute Maynooth University",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "alan.waldron.2021@mumail.ie",
        "twitter": "AlWaldron",
        "ie_text": "Bíonn Alan Waldron agus plé leis na healaíona cruthaitheacha agus tá spéis acadúil aige i Léann an Chóirithe, i Léann an Taibhléirithe agus i léiriú thráma cultúrtha na hÉireann ar an stáitse agus ar an scáileán. Bhain sé máistreacht amach sna Cultúir Dhomhanda in Ollscoil Cardiff. \n Baineann a thaighde dochtúireachta leis an gcaoi ar féidir le drámadóirí comhaimseartha leas a bhaint as na drámaí sin ó thréimhse na Nua-hAoise Luaithe a ligeadh i ndearmad le dul i ngleic le teannais agus trámaí comhaimseartha na hÉireann.",
        "text": "Alan Waldron is a creative arts practitioner with an academic interest in adaptation studies, performance studies and the representations of Irish cultural trauma on stage and screen. He holds a Masters from Cardiff University in Global Cultures. \n His PhD research is concerned with how contemporary performing arts practitioners can take largely forgotten “Irish” playtexts from the Early Modern period and use them as a basis for engagement with contemporary Irish culture’s tensions and traumas."
    }
}
