{

    "1": {
        "id": 1,
        "name": "Pat Palmer",
        "ie_title": "Ollamh le litríocht, Ollscoil Mhá Nuad",
        "email": "pat.palmer@mu.ie",
        "ie_text": "Bíonn Patricia Palmer ag obair ar theagmháil chultúr, in Éirinn sa Nua-aois Luath go príomha – ar mhalartuithe coimhlinteacha idir coilínigh Shasanacha agus an saol Gealach, ar an gcoilíniú teanga, ar aeistéitic an fhoréigin agus ar pholaitíocht an aistriúcháin. Tá gné fhollasach chomparáideach ag baint lena cuid taighde, agus plé déanta aici ar aistriúcháin ar Ariosto, Ercilla agus Virgil, agus ar fhilíocht chlasaiceach na Gaeilge. Is í a scríobh Language and Conquest in Early Modern Ireland: English Renaissance Literature and Elizabeth Imperial Expansion (Cambridge University Press, 2001) agus The Severed Head and the Grafted Tongue: Translating Violence in Early Modern Ireland (Cambridge University Press, 2014). Foilsíodh saothair léi in English Literary Renaissance, Translation Studies, Renaissance Quarterly, Irish Historical Studies, Literature Compass, agus i gcnuasaigh aistí eile, ar réimse fairsing ábhar. Foilsíodh Early Modern Criticism in a Time of Crisis i Samhain 2022, atá curtha in eagar aici agus ag David Baker. Castacht agus trasnaíocht chultúr liteartha na hÉireann sa Nua-aois Luath is ábhar don leabhar atá idir lámha faoi láthair aici: Darkness Echoing, or Did Ireland Have a Renaissance? /n Tar éis di céim mháistreachta a bhaint amach i gColáiste na hOllscoile, Corcaigh, chaith Pat seal ag obair san Ataen agus sa Bhruiséil, sular thug sí faoi thaighde dochtúireachta in Ollscoil Oxford. Bhí sí in léachtóir sinsearach in Ollscoil York (2000-2008) agus i gColáiste na Ríthe i Londain ina dhiaidh sin í (2008-2016). Tá sí ina hOllamh le Litríocht na hAthbheochana in Ollscoil Mhá Nuad ó bhí 2017 ann. /n Bhronn an Chomhairle um Thaighde in Éirinn (IRC) ardghradaim uirthi sa bhliain 2019, agus is í príomhthaighdeoir MACMORRIS í, tionscadal 4 bliana a bhfuil sé mar aidhm aige saibhreas agus fairsinge ghníomhachtaí cultúrtha na hÉireann sa Nua-Aois Luath, thar theangacha agus eitneachtaí, a léiriú."
    },
    "2": {
        "id": "2",
        "name": "Evan Bourke",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "evan.bourke@mu.ie",
        "twitter": "evan_bourke",
        "ie_text": "Is staraí liteartha é Evan Bourke a bhfuil suim ar leith aige i stair na hÉireann sa Nua-aois Luath agus sna daonnachtaí digiteacha. Tá suim ar leith aige sa scríbhneoireacht bheathaisnéiseach agus scríbhneoirneacht na mban, chomh maith le húsáid anailís ar líonraí agus léirshamhlú sonraí mar bhealach le scrúdú a dhéanamh ar théacsanna na Nua-aoise Luaithe. Chríochnaigh sé a PhD (maoinithe ag RECIRC agus OÉ Gaillimh) le Ollscoil na hÉireann Gaillimh in 2018. /n Rinneadh anailís ina thráchtas ar mhúnlú agus ar léiriú cháil triúr ban a raibh baint acu le ciorcal comhfhreagrais Samuel Hartlib: Katherine Jones, Viscountess Ranelagh (1615-1691); Dorothy Moore Dury (c.1612-1664); agus Jean Appelius (fl.1638-1648). /n Sular thosaigh sé le MACMORRIS, ba thaighdeoir iardhochtúireachta é Evan le RECIRC (The Reception and Circulation of Early Modern Women’s Writing, 1550-1700), áit a raibh páirt aige i ndearadh shuíomh idirlín agus taispeántas RECIRC. Tá saothar foilsithe aige in Literature Compass agus The Seventeenth Century Journal, Irish Historical Studies, Renaissance Quarterly, agus Huntington Library Quarterly ar ábhair a bhaineann le hanailís líonraí, stair na nban, agus Éire sa Nua-aois Luath. "
    },
    "3": {
        "id": "3",
        "name": "Deirdre Nic Chárthaigh",
        "ie_title": "Léachtóir le Gaeilge nua-aimseartha, Coláiste na Tríonóide",
        "email": "nicchard@tcd.ie",
        "twitter": "Deirdrenicc",
        "ie_text": "Bhí Deirdre Nic Chárthaigh ag obair mar thaighdeoir iardhochtúireachta ar thionscadal MACMORRIS idir 2019 agus 2021.  Tá sí ag obair anois mar léachtóir i gColáiste na Tríonóide, Baile Átha Cliath. Baineann a cuid taighde le filíocht Chlasaiceach na hÉireann agus le traidisiún na lámhscríbhinní sa tréimhse i ndiaidh na Nua-Aoise Luaithe. Tá ailt foilsithe aici in Celtica agus in Ériu. I measc na bhfoilsiúchán léi a bheidh ag teacht amach go luath tá alt in Renaissance Quarterly agus eagrán den scéal Bodach an Chóta Lachtna, a bheidh mar chuid de shraith téacsanna Gaeilge ón Nua-Aois Luath atá á foilsiú ag Institiúid Ard-Léinn Bhaile Átha Cliath. Tá Deirdre ag obair ar thionscadal Léamh.org chomh maith ó bhí 2018 ann."
    },
    "4": {
        "id": "4",
        "name": "Philip Mac a’ Ghoill",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "Philip.MacAGhoill@mu.ie",
        "ie_text": "Chríochnaigh Philip Mac a’ Ghoill a PhD le Coláiste na Tríonóide i mí an Mhárta 2021. Bíonn a chuid taighde dírithe ar fhilíocht na Nua-Ghaeilge Clasaicí den chuid is mó, ag déanamh scrúdú ar theanga, gnéithe liteartha agus comthéacs stairiúil na ndánta. Tá suim aige fosta in úsáid teicneolaíocht na ndaonnachtaí digiteacha le taighde sa réimse seo a chur chun cinn, agus bhí sé páirteach sna tograí Léamh.org agus Corpus Fhilíocht na Nua-Ghaeilge Clasaicí ar SketchEngine sular thosaigh sé le MACMORRIS in 2021. /n Tá saothar foilsithe aige in Celtica le gairid, eagráin úra de dhánta le hUilliam Óg Mac an Bhaird taobh le haistriúcháin agus nótaí ar an teanga agus comhthéacs stairiúil."
    },
    "5": {
        "id": "5",
        "name": "Rupavathi S",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "rupavathi.subramani@mu.ie",
        "ie_text": "Is ríomhchláraitheoir Bunachair agus réalóir Cúil in Institiúid na nEalaíon agus na nDaonnachtaí in Ollscoil Mhá Nuad í Rupavathi. Tá Rupavathi freagrach as dearadh agus as forbairt infreastruchtúr, bunachar agus feidhmchláir fhoireann thaighde MACMORRIS. Is í a bheidh ag cruthú na n-uirlisí do léirshamhlú sonraí an tionscnaimh, léarscáil idirghníomhach agus léirshamhluithe gréasáin ina measc. \n Bhain Rupavathi céim amach sa Teicneolaíocht Faisnéise sa bhliain 2016 agus chaith sí seal ag obair mar réalóir bogearraí in India agus sa RA."
    },
    "6": {
        "id": "6",
        "name": "Alan Waldron",
        "ie_title": "Arts & Humanities Institute, Ollscoil Mhá Nuad",
        "email": "alan.waldron.2021@mumail.ie",
        "twitter": "AlWaldron",
        "ie_text": "Bíonn Alan Waldron agus plé leis na healaíona cruthaitheacha agus tá spéis acadúil aige i Léann an Chóirithe, i Léann an Taibhléirithe agus i léiriú thráma cultúrtha na hÉireann ar an stáitse agus ar an scáileán. Bhain sé máistreacht amach sna Cultúir Dhomhanda in Ollscoil Cardiff. \n Baineann a thaighde dochtúireachta leis an gcaoi ar féidir le drámadóirí comhaimseartha leas a bhaint as na drámaí sin ó thréimhse na Nua-hAoise Luaithe a ligeadh i ndearmad le dul i ngleic le teannais agus trámaí comhaimseartha na hÉireann."
    }

}
