[
    {
        "id": 1,
        "name": "Pat Palmer",
        "title": "Professor of Renaissance Literature, Maynooth University",
        "email": "pat.palmer@mu.ie",
        "text": "Ollamh le Litríocht na hAthbheochana in Ollscoil Mhá Nuad í Pat Palmer. Bíonn sí ag obair ar theagmháil chultúr, in Éirinn sa Nua-aois Luath go príomha – ar mhalartuithe coimhlinteacha idir coilínigh Shasanacha agus an saol Gealach, ar an gcoilíniú teanga, ar aeistéitic an fhoréigin agus ar pholaitíocht an aistriúcháin. \n Is í a scríobh Language and Conquest in Early Modern Ireland: English Renaissance Literature and Elizabeth Imperial Expansion (Cambridge University Press, 2001) agus The Severed Head and the Grafted Tongue: Translating Violence in Early Modern Ireland (Cambridge University Press, 2014). Tá gné fhollasach chomparáideach ag baint lena cuid taighde, agus plé déanta aici ar aistriúcháin ar Ariosto, Ercilla agus Virgil, agus ar fhilíocht chlasaiceach na Gaeilge. Foilsíodh saothair léi in English Literary Renaissance, Translation Studies, Renaissance Quarterly, Irish Historical Studies, Literature Compass, agus i gcnuasaigh aistí eile, ar réimse fairsing ábhar. \n I measc na n-ábhar sin tá fulaingt na colainne, fo-oifigigh sa taifead staire; teangairí tachta; Imeacht na nIarlaí, scríbhneoireacht na deoraíochta; Edmund Spenser in Éirinn, Richard Stanihurt agus cúrsaí aistriúcháin, agus an reitric choilíneach. \n Tar éis di céim mháistreachta a bhaint amach i gColáiste na hOllscoile, Corcaigh, chaith Pat seal ag obair san Ataen agus sa Bhruiséil, sular thug sí faoi thaighde dochtúireachta in Ollscoil Oxford. Bhí sí in léachtóir sinsearach in Ollscoil York (2000-2008) agus i gColáiste na Ríthe i Londain ina dhiaidh sin í (2008-2016). Tá sí ina hOllamh le Litríocht na hAthbheochana in Ollscoil Mhá Nuad ó bhí 2017 ann. Castacht agus trasnaíocht chultúr liteartha na hÉireann sa Nua-aois Luath is ábhar don leabhar atá idir lámha faoi láthair aici: Darkness Echoing, or Did Ireland Have a Renaissance?"
    },
    {
        "id": "2",
        "name": "Evan Bourke",
        "title": "Arts & Humanities Institute Maynooth University",
        "email": "evan.bourke@mu.ie",
        "twitter": "evan_bourke",
        "text": "Is staraí liteartha é Evan Bourke a bhfuil suim ar leith aige i stair na hÉireann sa Nua-aois Luath agus sna daonnachtaí digiteacha. Tá suim aige sa scríbhneoireacht bheathaisnéiseach agus scríbhneoirneacht na mban go háirithe, chomh maith le úsáid anailís ar líonraí agus léirshamhlú sonraí mar bhealach le scrúdú a dhéanamh ar théacsanna na Nua-aoise Luaithe. Chríochnaigh sé a PhD (maoinithe ag RECIRC agus OÉ Gaillimh) le Ollscoil na hÉireann Gaillimh in 2018. \n Rinneadh anailís ina thráchtas ar mhúnlú agus ar léiriú cháil triúr ban a raibh baint acu le ciorcal comhfhreagrais Samuel Hartlib: Katherine Jones, Viscountess Ranelagh (1615-1691); Dorothy Moore Dury (c.1612-1664); agus Jean Appelius (fl.1638-1648). \n Sular thosaigh sé le MACMORRIS, ba thaighdeoir iardhochtúireachta é Evan le RECIRC (The Reception and Circulation of Early Modern Women’s Writing, 1550-1700), áit a raibh páirt aige i ndearadh shuíomh idirlín agus taispeántas an RECIRC. Tá saothar foilsithe aige in Literature Compass agus The Seventeenth Century ar léirshamhlú sonraí ar líonra comhfhreagrais Samuel Hartib, agus ar an fháilte a cuireadh roimh bhanscríbhneoirí i líonra Hartib faoi seach."
    },
    {
        "id": "3",
        "name": "Deirdre Nic Chárthaigh",
        "title": "Arts & Humanities Institute Maynooth University",
        "email": "deirdre.niccharthaigh@mu.ie",
        "twitter": "Deirdrenicc",
        "text": "Bhain Deirdre Nic Chárthaigh céim dhochtúireachta (maoinithe ag an IRC agus ag TCD) amach i roinn na Gaeilge i gColáiste na Tríonóide sa bhliain 2019 faoi stiúir an Dr. Eoin Mac Chárthaigh. \n Eagrán den scéal rómánsaíochta Bodach an Chóta Lachtna ab ábhar dá tráchtas. Mar aon le prós na Nua-Ghaeilge Moiche, tá spéis mhór aici san fhilíocht chlasaiceach agus i seachadadh téacsanna i lámhscríbhinní sa tréimhse iarchlasaiceach. Bíonn cúrsaí ar an bprós agus ar an bhfilíocht chlasaiceach á dteagasc aici agus tá sí páirteach i bhforbairt áiseanna foghlama agus taighde. Tá sí ina ball de mheitheal oibre an tionscnaimh Léamh.org ó bhí 2018 ann. \n Ó bhí Deireadh Fómhair 2021 ann, is taighdeoir iardhochtúireachta í Deirdre in Institiúid Ard-Léinn Bhaile Átha Cliath áit a bhfuil sé ag déanamh taighde ar an chláirseach i bhfilíocht na Nua-Ghaeilge Clasaicí."
    },
    {
        "id": "4",
        "name": "Philip Mac a’ Ghoill",
        "title": "Arts & Humanities Institute Maynooth University",
        "email": "Philip.MacAGhoill@mu.ie",
        "text": "Chríochnaigh Philip Mac a’ Ghoill a PhD le Coláiste na Tríonóide i mí an Mhárta 2021. Bíonn a chuid taighde dírithe ar fhilíocht na Nua-Ghaeilge Clasaicí den chuid is mó, ag déanamh scrúdú ar theanga, gnéithe liteartha agus comthéacs stairiúil na ndánta. Tá suim aige fosta in úsáid teicneolaíocht na ndaonnachtaí digiteacha le taighde sa réimse seo a chur chun cinn, agus bhí sé páirteach sna tograí Léamh.org agus Corpus Fhilíocht na Nua-Ghaeilge Clasaicí ar SketchEngine sular thosaigh sé le MACMORRIS. \n Le gairid, chaith sé tréimhse i réimse na sochtheangeolaíochta ag obair mar Oifigeach Pleanála Teanga do Ghaeltacht Chloich Cheann Fhaola. Tá saothar foilsithe aige in Celtica ag cur eagrán úr den dán Trom an suan-sa ort, a Aodh ar fáil chomh maith le haistriúchán agus nótaí ar an teanga agus comhthéacs stairiúil."
    },
    {
        "id": "5",
        "name": "Rupavathi S",
        "title": "Arts & Humanities Institute Maynooth University",
        "email": "rupavathi.subramani@mu.ie",
        "text": "Is ríomhchláraitheoir Bunachair agus réalóir Cúil in Institiúid na nEalaíon agus na nDaonnachtaí in Ollscoil Mhá Nuad í Rupavathi. Tá Rupavathi freagrach as dearadh agus as forbairt infreastruchtúr, bunachar agus feidhmchláir fhoireann thaighde MACMORRIS. Is í a bheidh ag cruthú na n-uirlisí do léirshamhlú sonraí an tionscnaimh, léarscáil idirghníomhach agus léirshamhluithe gréasáin ina measc. \n Bhain Rupavathi céim amach sa Teicneolaíocht Faisnéise sa bhliain 2016 agus chaith sí seal ag obair mar réalóir bogearraí in India agus sa RA."
    },
    {
        "id": "6",
        "name": "Alan Waldron",
        "title": "Arts & Humanities Institute Maynooth University",
        "email": "alan.waldron.2021@mumail.ie",
        "twitter": "AlWaldron",
        "text": "Bíonn Alan Waldron agus plé leis na healaíona cruthaitheacha agus tá spéis acadúil aige i Léann an Chóirithe, i Léann an Taibhléirithe agus i léiriú thráma cultúrtha na hÉireann ar an stáitse agus ar an scáileán. Bhain sé máistreacht amach sna Cultúir Dhomhanda in Ollscoil Cardiff. \n Baineann a thaighde dochtúireachta leis an gcaoi ar féidir le drámadóirí comhaimseartha leas a bhaint as na drámaí sin ó thréimhse na Nua-hAoise Luaithe a ligeadh i ndearmad le dul i ngleic le teannais agus trámaí comhaimseartha na hÉireann."
    }
]
